# Acceso y actualización de los datos

In [284]:
#Librerias
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [285]:
#acceso a los datos
tabla3=pd.DataFrame(
        data=[('Estonia',8.4,7.7,6.7,'A'),
        ('Ireland',193.5,227.76,221.05,'B'),
        ('Greece',1.4,1.6,1.5,'A'),
        ('Spain',50.52,58.9,46.72,'C'),
        ('France',415.09,423.1,400.52,'A')],
        columns=['Desc','2004','2005','2006','Tipo'],
        index=['EE','IE','EL','ES','FR'])
print(tabla3.info())
print(tabla3)

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, EE to FR
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Desc    5 non-null      object
 1   2004    5 non-null      float64
 2   2005    5 non-null      float64
 3   2006    5 non-null      float64
 4   Tipo    5 non-null      object
dtypes: float64(3), object(2)
memory usage: 240.0+ bytes
None
       Desc    2004    2005    2006 Tipo
EE  Estonia    8.40    7.70    6.70    A
IE  Ireland  193.50  227.76  221.05    B
EL   Greece    1.40    1.60    1.50    A
ES    Spain   50.52   58.90   46.72    C
FR   France  415.09  423.10  400.52    A

In [286]:
#Acceso a los datos

print(tabla3.Desc)
print(tabla3['2004'])

EE    Estonia
IE    Ireland
EL     Greece
ES      Spain
FR     France
Name: Desc, dtype: object
EE      8.40
IE    193.50
EL      1.40
ES     50.52
FR    415.09
Name: 2004, dtype: float64

In [287]:
#acceder a un conjunto de filas y columnas
#loc

print(tabla3.loc['EE':'IE'])
#un rango ":" que va seguido 
print(tabla3.loc['IE':'ES',['2004','2005']])
#una fila específica
print(tabla3.loc[['IE','ES'],['2004','2006']])

       Desc   2004    2005    2006 Tipo
EE  Estonia    8.4    7.70    6.70    A
IE  Ireland  193.5  227.76  221.05    B
      2004    2005
IE  193.50  227.76
EL    1.40    1.60
ES   50.52   58.90
      2004    2006
IE  193.50  221.05
ES   50.52   46.72

In [288]:
#Coger un valor escalar
tabla3.loc['IE','2006']

221.05

In [289]:
#indexar filas y columnas con valores de tipo int

#recuperar la primer fila
print(tabla3.iloc[:1])

#recuperar las 3 primeras filas y recuperar la ultima fila
print(tabla3.iloc[:3])
print(tabla3.iloc[-1:])

       Desc  2004  2005  2006 Tipo
EE  Estonia   8.4   7.7   6.7    A
       Desc   2004    2005    2006 Tipo
EE  Estonia    8.4    7.70    6.70    A
IE  Ireland  193.5  227.76  221.05    B
EL   Greece    1.4    1.60    1.50    A
      Desc    2004   2005    2006 Tipo
FR  France  415.09  423.1  400.52    A

In [290]:
#sacar la fila 1 y las columnas 0,1 y la ultima
tabla3.iloc[:1,[0,1,-1]]

       Desc  2004 Tipo
EE  Estonia   8.4    A

In [291]:
#actualizaciono de datos de un dataframe
tabla2 = tabla3
tabla2.Tipo = 'D'
print(tabla2)
tabla2.Tipo = ['A','B','C','D','E']
print(tabla2)

       Desc    2004    2005    2006 Tipo
EE  Estonia    8.40    7.70    6.70    D
IE  Ireland  193.50  227.76  221.05    D
EL   Greece    1.40    1.60    1.50    D
ES    Spain   50.52   58.90   46.72    D
FR   France  415.09  423.10  400.52    D
       Desc    2004    2005    2006 Tipo
EE  Estonia    8.40    7.70    6.70    A
IE  Ireland  193.50  227.76  221.05    B
EL   Greece    1.40    1.60    1.50    C
ES    Spain   50.52   58.90   46.72    D
FR   France  415.09  423.10  400.52    E

In [292]:
#tranformar valores de una tabla

#la funcion map aplica la función a cada uno de los valores de la columna

tabla2.Desc = tabla2.Desc.map(lambda x : str.upper(x))
print(tabla2)

       Desc    2004    2005    2006 Tipo
EE  ESTONIA    8.40    7.70    6.70    A
IE  IRELAND  193.50  227.76  221.05    B
EL   GREECE    1.40    1.60    1.50    C
ES    SPAIN   50.52   58.90   46.72    D
FR   FRANCE  415.09  423.10  400.52    E

In [293]:
# modificar todos los tipo númerico del dataframe para que se expresen con un decimal

tabla2 = tabla2.applymap( lambda x : round(x,1) if type(x) == float else x)
print(tabla2)

       Desc   2004   2005   2006 Tipo
EE  ESTONIA    8.4    7.7    6.7    A
IE  IRELAND  193.5  227.8  221.1    B
EL   GREECE    1.4    1.6    1.5    C
ES    SPAIN   50.5   58.9   46.7    D
FR   FRANCE  415.1  423.1  400.5    E

In [294]:
#eliminar columnas en un dataframe

#pop elimina la columna especificada
print(tabla3)
columna = tabla3.pop('Tipo')
print(columna)
print(tabla3)
type(columna)

       Desc    2004    2005    2006 Tipo
EE  ESTONIA    8.40    7.70    6.70    A
IE  IRELAND  193.50  227.76  221.05    B
EL   GREECE    1.40    1.60    1.50    C
ES    SPAIN   50.52   58.90   46.72    D
FR   FRANCE  415.09  423.10  400.52    E
EE    A
IE    B
EL    C
ES    D
FR    E
Name: Tipo, dtype: object
       Desc    2004    2005    2006
EE  ESTONIA    8.40    7.70    6.70
IE  IRELAND  193.50  227.76  221.05
EL   GREECE    1.40    1.60    1.50
ES    SPAIN   50.52   58.90   46.72
FR   FRANCE  415.09  423.10  400.52

pandas.core.series.Series

In [295]:
print(tabla3.index)
print(tabla3.columns)
print(tabla3)
# axis = 0 es el indice
n1 = tabla3.drop(['EE','IE'], axis = 0)
print(n1)
# axis = 1 son las cabeceras de las columnas
n2 = tabla3.drop(['Desc','2004'], axis = 1)
print(n2)

Index(['EE', 'IE', 'EL', 'ES', 'FR'], dtype='object')
Index(['Desc', '2004', '2005', '2006'], dtype='object')
       Desc    2004    2005    2006
EE  ESTONIA    8.40    7.70    6.70
IE  IRELAND  193.50  227.76  221.05
EL   GREECE    1.40    1.60    1.50
ES    SPAIN   50.52   58.90   46.72
FR   FRANCE  415.09  423.10  400.52
      Desc    2004   2005    2006
EL  GREECE    1.40    1.6    1.50
ES   SPAIN   50.52   58.9   46.72
FR  FRANCE  415.09  423.1  400.52
      2005    2006
EE    7.70    6.70
IE  227.76  221.05
EL    1.60    1.50
ES   58.90   46.72
FR  423.10  400.52

In [296]:
# Insertar datos en un Dataframe

#insertar una fila con un valor dado (pero puede ser un array de datos)
tabla3['UNIDAD'] = 'Nan'
print(tabla3)
#suma de filas 
tabla3['Total'] = tabla3['2004'] + tabla3['2005'] + tabla3['2006']
print(tabla3)

       Desc    2004    2005    2006 UNIDAD
EE  ESTONIA    8.40    7.70    6.70    Nan
IE  IRELAND  193.50  227.76  221.05    Nan
EL   GREECE    1.40    1.60    1.50    Nan
ES    SPAIN   50.52   58.90   46.72    Nan
FR   FRANCE  415.09  423.10  400.52    Nan
       Desc    2004    2005    2006 UNIDAD    Total
EE  ESTONIA    8.40    7.70    6.70    Nan    22.80
IE  IRELAND  193.50  227.76  221.05    Nan   642.31
EL   GREECE    1.40    1.60    1.50    Nan     4.50
ES    SPAIN   50.52   58.90   46.72    Nan   156.14
FR   FRANCE  415.09  423.10  400.52    Nan  1238.71

In [301]:
#insertar datos en un fila concreta

#Al añadir una serie a un dataframe, debe tener el mismo indeces si es una columna 
serie = pd.Series([1,2,3,4,5], index=['EE','IE','EL','ES','FR'], dtype=float)
print(serie,type(serie))
#tabla3.insert(2,'lucas',serie)
print(tabla3)

EE    1.0
IE    2.0
EL    3.0
ES    4.0
FR    5.0
dtype: float64 <class 'pandas.core.series.Series'>
       Desc    2004  lucas    2005    2006 UNIDAD    Total
EE  ESTONIA    8.40    1.0    7.70    6.70    Nan    22.80
IE  IRELAND  193.50    2.0  227.76  221.05    Nan   642.31
EL   GREECE    1.40    3.0    1.60    1.50    Nan     4.50
ES    SPAIN   50.52    4.0   58.90   46.72    Nan   156.14
FR   FRANCE  415.09    5.0  423.10  400.52    Nan  1238.71